tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'ack'
brew 'bash-completion'
brew 'bash'
brew 'brew-cask-completion'
brew 'git'

brew 'rbenv'
brew 'ruby-build'
brew 'nodenv'
brew 'node-build'

brew 'webp'
brew 'gifsicle'
brew 'ffmpeg', args: ['with-fontconfig', 'without-lame', 'without-qtkit', 'without-x264', 'without-xvid']
brew 'librsvg'
brew 'imagemagick', args: ['with-fontconfig', 'with-librsvg', 'with-webp']
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'jpeg'
brew 'libtiff'

tap 'puma/puma'
brew 'puma/puma/puma-dev'

tap 'caskroom/cask'
cask 'alfred'
cask 'dropbox'
cask 'slack'
cask '1password'
cask 'google-chrome'
cask 'iterm2'
cask 'google-drive'
cask 'skype'
cask 'spotify'
cask 'evernote'
cask 'magicprefs'
cask 'calendly-click'
cask 'caffeine'
cask 'appcleaner'
cask 'ynab'
cask 'transmission'
cask 'kodi'
cask 'istat-menus'
cask 'kindle'
cask 'grammarly'
# cask 'imageoptim'
# cask 'firefox'

brew 'mas'
mas 'iA Writer', id: 775737590
mas 'Divvy', id: 413857545
mas 'Skitch', id: 425955336
mas 'Twitter', id: 409789998
mas 'Freckle', id: 879917538
# mas 'Keynote', id: 409183694
