tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# General developer tools
brew 'ack'
brew 'bash-completion'
brew 'bash'
brew 'brew-cask-completion'
brew 'git'
brew 'vim'

# Application development related tools
brew 'postgresql'

# Ruby related tools
# brew 'rbenv'
# brew 'ruby-build'

# Front-end development related tools
brew 'nodenv'
brew 'node-build'

# Elixir related tools
brew 'elixir'

# brew 'webp'
# brew 'gifsicle'
# brew 'ffmpeg', args: ['with-fontconfig', 'without-lame', 'without-qtkit', 'without-x264', 'without-xvid']
# brew 'librsvg'
# brew 'imagemagick', args: ['with-fontconfig', 'with-librsvg', 'with-webp']
# brew 'libpng'
# brew 'freetype'
# brew 'fontconfig'
# brew 'jpeg'
# brew 'libtiff'
brew 'tree'

# brew 'exercism'

# tap 'puma/puma'
# brew 'puma/puma/puma-dev'

cask 'alfred'
cask 'dropbox'
cask 'slack'
cask '1password'
cask 'google-chrome'
cask 'iterm2'
# cask 'skype'
cask 'spotify'
cask 'evernote'
# cask 'magicprefs'
cask 'appcleaner'
# cask 'transmission'
# cask 'kodi'
cask 'istat-menus'
cask 'kindle'
cask 'grammarly'
cask 'whatsapp'
cask 'java'
cask 'google-drive'
cask 'krisp'
cask 'audio-hijack'
# cask 'imageoptim'
# cask 'firefox'
cask 'visual-studio-code'

brew 'mas'
mas 'iA Writer', id: 775737590
mas 'Divvy', id: 413857545
# mas 'Skitch', id: 425955336
mas 'Amphetamine', id: 937984704
mas 'Be Focused Pro - Focus Timer', id: 961632517
mas 'MindNode', id: 1289197285
mas 'Keynote', id: 409183694
